In [46]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [47]:
from sklearn.model_selection import train_test_split 
from sklearn.metrics import confusion_matrix, classification_report
from sklearn.metrics import accuracy_score
from sklearn.tree import DecisionTreeClassifier

In [48]:
df=pd.read_csv('titanic.csv')

In [49]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
df.drop(['Name','Ticket','Cabin','PassengerId'],axis=1,inplace=True)

In [51]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [52]:
lr_sex=LabelEncoder()
lr_Embarked=LabelEncoder()

In [53]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [54]:
df['Sex']=lr_sex.fit_transform(df['Sex'])
df['Embarked']=lr_Embarked.fit_transform(df['Embarked'])

In [55]:
X=df.drop(['Survived'],axis=1)
y=df.Survived

In [56]:
X

     Pclass  Sex        Age  SibSp  Parch     Fare  Embarked
0         3    1  22.000000      1      0   7.2500         2
1         1    0  38.000000      1      0  71.2833         0
2         3    0  26.000000      0      0   7.9250         2
3         1    0  35.000000      1      0  53.1000         2
4         3    1  35.000000      0      0   8.0500         2
..      ...  ...        ...    ...    ...      ...       ...
886       2    1  27.000000      0      0  13.0000         2
887       1    0  19.000000      0      0  30.0000         2
888       3    0  29.699118      1      2  23.4500         2
889       1    1  26.000000      0      0  30.0000         0
890       3    1  32.000000      0      0   7.7500         1

[891 rows x 7 columns]

In [57]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3, 
                                                    random_state=2018,
                                                    stratify=y)

In [58]:
model=DecisionTreeClassifier()

In [59]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [62]:
y_pred=model.predict(X_test)

In [65]:
model.predict([[3,1,22.000000,1,0,7.2500,2]])

array([0], dtype=int64)

In [63]:
accuracy_score(y_pred,y_test)

0.746268656716418